tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "nikaro/tap"
brew "aspell"
brew "autoenv"
brew "automake"
brew "asdf"
brew "aspell"
brew "autoenv"
brew "xz"
brew "awscli"
brew "bash-completion"
brew "glib"
brew "openssl@1.1"
brew "deno"
brew "git"
brew "gnutls"
brew "gnupg"
brew "pango"
brew "the_silver_searcher"
brew "thefuck"
brew "tree"
brew "zlib"
brew "zsh"
brew "python@3.11"
brew "gh"
brew "hadolint"
brew "helm"
brew "mackup"
brew "python@3.11"
brew "wget"
cask "dbeaver-community"
cask "docker"
cask "iterm2"
cask "lens"
cask "mockoon"
cask "openvpn-connect"
cask "visual-studio-code"
cask "zoom"
